app/controllers/book_controller.rb

INSERT INTO `books` (`name`, `author`, `created_at`, `updated_at`) VALUES ('yuio', 'cvbnm', '2022-06-20 10:53:17.256132', '2022-06-20 10:53:17.256132')
---
  def create
    book = Book.new(book_params)
    if book.save

SELECT `books`.* FROM `books`
---
  def read
    render json: Book.all , status: 200

SELECT `books`.* FROM `books` WHERE `books`.`id` = 6 LIMIT 1
UPDATE `books` SET `books`.`name` = 'ali', `books`.`author` = 'arabic', `books`.`updated_at` = '2022-06-20 10:58:51.628808' WHERE `books`.`id` = 6
---
  def update
    book1 = Book.find(params[:id])
    if book1.update(book_params)

DELETE FROM `books` WHERE `books`.`id` = 2
---
  def destroy
 Book.destroy(params[:id])

SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def set_book
    @book = Book.find(params[:id])